{
    "htmlBasics": "HTML stands for HyperText Markup Language. It is the standard language used to create web pages and web applications. HTML tags are used to define elements on a web page. Elements are composed of tags, attributes, and content. Basic HTML tags include <html>, <head>, <body>, <p>, <a>, and <img>.",
  
    "india": "India is a well-known tourist hub and an exciting holiday destination for exploring the wild, admiring architectural wonders, undertaking religious pilgrimages, going on a shopping spree, trying new adventures, discovering age-old historic treasures and lots more. With so many places to see and experiences to try, choosing that one perfect tourist destination in India for your next holiday can be quite confusing. This is why we have curated a list of the best tourist places in India that you can consider for your upcoming vacation and fulfill all your travel dreams! Agra: The historic city of Agra is one of the most loved tourist places in India as it houses the world-famous Taj Mahal, one of the seven wonders of the world. From architectural marvels such as Agra Fort and Fatehpur Sikri to mouthwatering local delicacies such as petha, this exciting tourist destination in India has it all. Best Time to Visit: October to March. Chandigarh: one of the best places in India , the well-planned city of Chandigarh has the perfect mix of traditional Punjabi culture and modernity. From its well-laid gardens to fascinating museums, every nook and corner of the city has something special to offer. Best Time to Visit: August to March. Coorg: Popularly touted as the ‘Scotland of India, Coorg in Karnataka is characterised by its perpetually misty landscape, rolling green hills and aromatic coffee plantations. This charming little hill station with its scenic views and colourful culture is a must-visit for every ardent nature lover. Best Time to Visit: October to March. Dhanaulti: An offbeat destination nestled quietly in the hills of Uttarakhand, Dhanaulti is like a long-lost pleasant dream that brings with it peace, comfort and quiet. If you have been on the lookout for a tranquil weekend getaway, then get your bags ready and head straight to this scenic and pristine little haven away from the city. Goa:A list of best tourist places in India would be incomplete without a mention of the national party capital, the famous land of sun, sand and sea, Goa! The laid back vibes, the stunning beaches, the charming churches, the unique cuisine, the legendary nightlife and magical sunsets have made Goa a favourite destination for friends and family alike. Best Time to Visit: October to March. Jaipur: A vibrant amalgamation of the old and the new, the capital of Rajasthan, the ‘Pink City of India’, Jaipur is every traveller’s dream destination. From romantic places to impressive forts, from trendy upscale markets to old bustling bazaars, from cultural festivities to a rich and authentic cuisine, Jaipur truly has it all. Best Time to Visit: October to March. Kashmir: A paradise on earth, the enthralling beauty of Kashmir is recognised all over the world. The gentle streams, the cool breeze, the green valleys and the magical vistas are no less than a gorgeous painting. Undoubtedly, one of the most beautiful places in India, Jammu and Kashmir is a must-visit destination. Best Time to Visit: April to October. Jodhpur: One of the most famous tourist places in India, the ‘Gateway to Thar Desert’, Jodhpur offers a glimpse of India’s rich historic past and royal legacy. Located in the middle of Rajasthan, it is one of the best cities to explore invincible forts, ancient temples, ancient bazaars and the colorful heritage of royal India. Best Time to Visit: November to February. Manikaran: A revered pilgrimage destination for Sikhs and Hindus, the three hot springs of Manikaran Sahib are believed to have a curative effect on diseases. Surrounded by an array of illustrious temples, these springs make for a popular destination among religious followers. Best Time to Visit: April to June. Munnar: Expansive tea estates, verdant hills and craggy peaks, the idyllic hill station of Munnar in Kerala is the ideal weekend getaway. Tucked away from the hustle and bustle of city life, it offers an opportunity to relax and rejuvenate while soaking in the plentitude of nature. Best Time to Visit: September to May. Mussoorie: Nestled in the foothills of the Garhwal Himalayan ranges, Mussoorie or the ‘Queen of Hills’ is a popular holiday choice because of its pristine natural setting. If your ideal vacation involves green hills, serene surroundings and a stunning view of the snow-capped mountains, then Mussoorie offers the perfect unadulterated escape in the lap of nature. Best Time to Visit: September to June. New Delhi: The ‘Capital City of India’ and the city with a heart, New Delhi is a paradise for food lovers. From its grand malls to historic forts, from swanky restaurants to little street food stalls, from famous college campuses to beautifully landscaped gardens, Delhi is filled with unique treasures waiting to be discovered. Best time to Visit: October to March. Ooty: Shrouded in mystery and mysticism, Ooty was once the headquarters of the East India Company. Now, it is a well-known hill station in Tamil Nadu that enjoys a pleasant climate all year round. Best Time to Visit: Throughout the year. Puducherry: A little town tucked away on the south-east coastline of India, Puducherry in Tamil Nadu is sometimes called the ‘French Riviera of the East’. Offering travellers some much-needed sanctity and serenity, its meandering streets and pristine beaches are picture-perfect. Best Time to Visit: October to March. Rishikesh: A tranquil spiritual center, Rishikesh is also an excellent hub of exciting water activities, making it a popular holiday destination among adventure enthusiasts and pilgrims alike. So, whether you have always wanted to meditate in the ‘Yoga Capital of the World’ or it was your dream to get your heart racing while trying thrilling adventures such as bungee jumping and whitewater rafting, Rishikesh is where you should be. Best Time to Visit: September to April. Shimla: The capital city of Himachal Pradesh, Shimla is one of the top tourist places in India. A gorgeous hill station with a rich colonial past, an iconic Mall road and a plethora of adventurous activities, it is immensely popular among honeymoon couples. Whether you want to escape the heat or enjoy a winter wonderland, Shimla is the place for you. Best Time to Visit: October to June. Udaipur: The crown jewel of the incredible state of Rajasthan, Udaipur is also known as the ‘City of Lakes’ and the ‘Venice of the East.’ Surrounded by the beautiful Aravalli hills in all directions, this charming city has abundance of both natural beauty and man-made splendour. Best Time to Visit: October to March. Discover the Best Tourist Places in India with IRCTC. Now that you have so many exciting places to see in India on your mind, it is time to plan the perfect holiday. But why go through the hassle of preparing an itinerary, selecting experiences, booking accommodation and getting tickets when you can simply pick a holiday that suits you in every way. IRCTC Tourism has a whole range of exciting domestic tour packages that range from luxury getaways to budget-friendly tours across the length and breadth of the country. If you’re looking for an affordable India tour package, then IRCTC tourism is the best place for it. Some of the country’s most famous and budget-friendly trains such as Bharat Darshan Tourist Train, Deluxe Tourist Train, Astha Circuit Special Tourist Train etc have been deployed to make your holiday affordable as well as unforgettable. Not only this, there are so many tour packages for all the famous tourist places in India that you will be spoilt for choice. Whether you want to visit historic sites or pilgrim centres, popular hill stations or gorgeous beaches, there is a tour package waiting for you on IRCTC Tourism. Moreover, most of the packages include essentials such as road transportation, accommodation, 2-3 time meals, hotel transfers, travel insurance and all applicable taxes as per itinerary. So, you can enjoy your holiday to the fullest without worrying about the details. The entire tour incorporates stringent health and safety protocols that are sure to put your mind at ease. By partnering with select personnel, hotels and travel agencies, IRCTC Tourism is endeavouring to keep all its tourists and patrons safe and healthy in the new normal. All transport vehicles are regularly disinfected and physical distancing norms are kept in place. Hotels for overnight accommodation are carefully handpicked and guests are informed about enhanced safety protocols while visiting sites such as monuments, parks or other destinations. Tour managers, guides, drivers and all the other members of the staff also go through periodic medical checks and daily body temperature checks to ensure their safety and those of our patrons. So, your safety is our top priority! Tour Packages Tailor-Made for You. If you've ever been in a situation where you love absolutely everything about a travel itinerary but it does not include just one destination you are keen on visiting, then you must be familiar with that frustrating feeling. At IRCTC Tourism, we understand our traveller's needs and that is why we give them the choice to customize tour packages according to their requirement. So, while you pick a dream destination from this list of famous places in India, top tourist places in India, most-loved tourist places in India and all the well-known tourist destinations in India, we are waiting to do all the planning to transform your dreams into a reality. To get your very own customized tour package, you just have to get in touch with IRCTC Zonal or Regional Tourism Offices and then you can enjoy the adventure of a lifetime without any hassle. With the increasing popularity of travel, IRCTC aims to provide the best possible experiences at various price points. Whether it’s a heritage tour in Rajasthan, an adventurous trek in Himachal Pradesh or a romantic honeymoon in Kerala, IRCTC has something for everyone. So what are you waiting for? It is time to pack your bags and embark on a journey full of new experiences and memories.",
    
    "lifestyle": "The changing face of India, from the streets of Delhi to the beaches of Goa, and the mountains of Himachal to the vast deserts of Rajasthan, is reflected in its vibrant culture and lifestyle. A rich amalgamation of the old and the new, modern India continues to grapple with its age-old traditions while embracing the influences of the outside world. Festivals such as Diwali, Eid and Christmas celebrated with equal fervor symbolize this multiculturalism. Today, India has a fast-growing economy with a bustling job market, thus drawing many young professionals into its big cities. On the culinary front, India is known for its diversity, which is reflected in the traditional foods, cooking methods and recipes, regional specialties, etc. The vibrant street food culture of India is an integral part of its identity. Whether it’s the chaat of Delhi, vada pav of Mumbai or dosa of South India, street food represents the diverse culinary landscape of the country. Furthermore, traditional Indian clothing varies from region to region. Sarees, lehengas and kurtas are popular choices for women, while men may wear dhotis, kurta-pyjamas or sherwanis, especially during festivals and weddings. The youth, however, are increasingly adopting Western styles of clothing. In urban areas, one can see a blend of traditional and contemporary styles, with many opting for fusion wear. The diverse lifestyle of Indians is also evident in the plethora of art forms such as dance, music, theatre and festivals that span the length and breadth of the country. From Kathak and Bharatanatyam to Bollywood and contemporary music, these art forms reflect the vibrant spirit of India.",
    
    "customs": "India is a country with a rich cultural heritage, and its customs reflect this diversity. Customs and traditions in India vary by region, community, and religion, often blending to create unique local practices. One of the most important customs in India is the greeting. The traditional greeting is 'Namaste', which involves folding the hands together and bowing slightly. This gesture symbolizes respect and acknowledges the divine in the other person. Indian hospitality is renowned; guests are treated with great respect, and the saying 'Atithi Devo Bhava' translates to 'the guest is God' reflects this sentiment. Festivals play a significant role in Indian customs, with Diwali, Holi, Eid, Christmas, and Navratri being some of the most widely celebrated. Each festival comes with its own set of rituals, food, and festivities, often lasting several days and bringing families and communities together. Marriage customs in India are equally elaborate and vary by region. Typically, they are grand affairs involving several ceremonies that can last for days, emphasizing family involvement and tradition. The wedding rituals often include pre-wedding events like Mehendi (henna application) and Sangeet (musical night), followed by the main wedding ceremony and a reception. Food is also an important aspect of Indian customs. Meals are usually served in a communal style, and vegetarianism is commonly practiced among many communities. Traditional meals often feature a variety of dishes, including lentils, vegetables, rice, and bread, and are typically enjoyed with family during festivals and special occasions. Overall, customs in India are deeply rooted in tradition, spirituality, and community, making them an integral part of the cultural fabric of the country."
  }
  